#include <stdio.h>

#define LIMIT 0.008

int main() {
  float S = 0, c = 1;
  int sign = 1;

  while (c < LIMIT) {
    S = S + c;
    sign = (-1) * sign;
    c = sign * (1.0 / 2) * c;
  }

  printf("%f\n", S);
}

/*
Για να λύσουμε το πρόβλημα, κάνουμε τα εξής:
1. Ελέγχουμε αν το c είναι μεγαλύτερο ή ίσο με το LIMIT αντί να το συγκρίνουμε
με το LIMIT στην αρχή, έτσι ώστε η συνθήκη να λειτουργεί σωστά για μικρότερους
όρους.
2. Στην έκφραση `S = S + (c * sign);` προσθέτουμε το c με το κατάλληλο πρόσημο.
3. Εναλλάσσουμε το πρόσημο μετά από κάθε πρόσθεση χρησιμοποιώντας την εντολή
`sign = -sign;`.
4. Το c μειώνεται στο μισό μετά από κάθε επανάληψη, όπως απαιτείται από την
άσκηση.
*/