/* File: about.c */ 

/* 
  το παραπάνω είναι ένα σχόλιο και υπάρχει
  μόνο για δικία μας εξυπηρέτηση. Δε προσφέρει
  τίποτα στον κώδικα.

  σχόλια μπορούν να γίνουν είτε με "//", για μία
  μόνο γραμμή ή με το συνδιασμο "/"+"*" "*"+"/" 
  για πολλαπλές γραμμές.
*/

/* 
  Για να μπορούμε να τυπώσουμε στην κονσόλα, standrad 
  input, χρησιμοποιούμε τη βιβλιοθήκη της c "stdio.h" =
  = standrad input output. 

  Tα includes συνηθήζουμε να τα κάνουμε όλα στην αρχή του αρχείου
*/
#include <stdio.h>


/*
  Κάθε c πρόγραμμα πρέπει να έχει μια main συνάρτηση, τύπου int
*/
int main() {
    /*
      Για να τυπώσουμε στην κοσνόλα, χρησιμοποιούμε τη συνάρτηση
      "printf" = print format
    */
        
    printf("Michael Jordan\n");
    printf("sdi2500999\n");

    /*
      Ο χαρακτήρας "%" έχει έναν ιδιαίτερο ρόλο μέσα στην 
      printf (κανει specify το format αλλά θα το δούμε πιο
      αναλυτικά στη συνέχεια :) ). Οπότε, για να διευκρινήσουμε
      πως εμείς θελουμε να το χρησιμοποιήσουμε ως χαρακτήρας και 
      όχι για να κάνει specify κάποιον τύπο, πρέπει να το βάλουμε
      2 φορες, "%%".

      Σημαντικό ρόλο παίζουν και τα "", όπου μέσα σε αυτά γράφουμε
      το κείμενο που θέλουμε να τυπωθεί. Για να τα χρησιμοποιήσουμε 
      ως χαρακτήρες χρησιμοποιούμε το "\", δηλαδή τα κάνουμε escape.

      Η χρήση του "\" είναι στάνταρ για να χρησιμοποιήσουμε τη 
      "δεύτερη φύση" ενός χαρακτήρα (το %% αποτελεί εξαίρεση). 
      Όπως και το "\n" = new line - λέμε τα με γραφτεί ο χαρακτήρας "n", αλλά
      να πάμε σε νέα γραμμή!
    */
    
    printf("I'm 100%% \"ready\"!\n");

    /*
      Εφόσον η main είναι τύπου int, πρέπει να επιστρέφει έναν ακέραιος.
      Ως σύμβαση, επιστρέφουμε 0 εαν η εκτέλεση τερματήσει χωρίς κάποιο
      πρόβλημα, ενώ 1 έαν προκύψει κάποιο σφάλμα.       
    */
    return 0;
}
