/*  
    κάνουμε compile γράφοντας στο terminal: gcc -o ex1_2 ex1_2.c
    τρέχουμε το πρόγραμμα μας γράφοντας στο terminal: ./ex1_2
*/

/* 
    Σημαντική σημείωση:
    Στην C, το 1 / 2, το 1 / 3, το 1 / 4 κτλπ δεν μας δίνει αποτέλεσμα 0.5 αλλά 0!
    Αυτό συμβαίνει επειδή κάνει διαίρεση μεταξύ ακεραίων.
    Για να το λύσουμε αυτό, πρέπει ο αριθμητής ή ο παρονομαστής ή και οι δύο να είναι δεκαδικοί.
    Για παράδειγμα, 1.0 / 2, 1 / 2.0, 1.0 / 2.0 και ένα πιο κουλό, το ((double) 1) / 2.
    Στο τελευταίο ουσιαστικά κάναμε cast το 1 από ακέραιο σε δεκαδικό!
*/

#include <stdio.h>

int main()
{
    double sum = 0;

    for (int i = 1; i <= 100; i++) {
        double temp = 1 / ((double)i * (double)i);  /* Είναι (σχεδόν!) το ίδιο με 1.0 / (i * i) (καλύτερο όμως το αρχικό!) */
        sum += temp;                                /* Είναι το ίδιο με sum = sum + temp */
    }

    printf("%f\n", sum);

    return 0;
}
