#include <stdio.h>

/* Στον ψευδωκόδικα που πήραμε δεν επιστρέφει κάτι η συνάρτηση, οπότε την ορίζουμε σαν void. */
void collatz(int n);

int main(void)
{
    collatz(22);
    return 0;
}

void collatz(int n)
{
    while (n != 1) {
        if (n % 2 == 0) 
            n /= 2;
        else
            n = n * 3 + 1;

        /* 
            Αντί για αυτό το μικρό if-else, μπορούμε να γράψουμε το εξής σε μία γραμμή:
            n = (n % 2) ? n / 2 : n * 3 + 1;
            Το οποίο σημαίνει:
            το n να γίνει ίσο με n / 2 αν το n είναι άρτιος ((n % 2) ?), αλλιώς (:) γίνε n * 3 + 1.
        */

       printf("%d\n", n);
    }
}