#include <stdio.h>

/*
    Πίνακες: συνεχόμενες διευθύνσεις μνήμης.
    Άρα, αν έχουμε έναν πίνακα χαρακτήρων με 10 θέσεις (έστω ch[10] ο πίνακας).
    Αν πχ ξεκινάει η πρώτη διεύθνση στο 1000, η δεύτερη θα είναι στο 1001, η τρίτη στο 1002 κοκ.
    Άρα, αν έχουμε έναν δείκτη που έχει την τιμή της πρώτης διεύθυνσης του πίνακα, μπορούμε να τον αντιμετωπίσουμε
    με τον ίδιο τρόπο!

    Οπότε, οι πίνακες και οι δείκτες καταλαβαίνουμε ότι μπορούν να συνδεθούν άρρηκτα. 
*/

void print_array(int *A, int n)
{
    for (int i = 0; i < n; ++i)
        printf("%d\t", A[i]);
}

// Έστω πίνακας Α[Ν]. Αν γράφουμε *(Α + i), αυτό ισοδυναμεί με Α[i]!

int main(void)
{
    int i, a[8], *pa;

    for (i=0; i<8; i++)
        a[i] = i*i;

    print_array(a, 8);          // το a είναι ισοδύναμο με &a[0]

    pa = &a[0];
    a[6] = *(a+4);
    print_array(a, 8);
    *(pa+3) = a[5];
    print_array(a, 8);
    a[0] = *((pa++)+2);
    print_array(a, 8);
    *((++pa)+5) = a[1];
    print_array(a, 8);
    *(&a[5]-1) = *(--pa);
    print_array(a, 8);

    printf("\n");

    return 0;
}
